UPDATE regions
SET ru_name = regexp_replace(
        ru_name,
        'Департамент\s+Экономических\s+Расследовани[ий]',
        'ДЭР'
              ),
    kz_name = CASE
                  WHEN kz_name ~ '[Ээ]кономикалық\s+[Тт]ергеп-[Тт]ексеру\s+[Дд]епартаменті'
        THEN regexp_replace(
                          regexp_replace(
                                  kz_name,
                                  '^\s*Қаржылық\s+[Мм]ониторинг\s+[Аа]генттігінің\s+',
                                  ''
                          ),
                          '[Ээ]кономикалық\s+[Тт]ергеп-[Тт]ексеру\s+[Дд]епартаменті',
                          'ЭТТД'
             )
                  ELSE kz_name
        END
WHERE ru_name ~ 'Департамент\s+Экономических\s+Расследовани[ий]'
   OR kz_name ~ '[Ээ]кономикалық\s+[Тт]ергеп-[Тт]ексеру\s+[Дд]епартаменті';